---
kind: property
id: P:Autodesk.Revit.DB.Electrical.WireSizeSet.IsEmpty
source: html/475cca05-1079-94b8-b2b3-7573d8874c70.htm
---
# Autodesk.Revit.DB.Electrical.WireSizeSet.IsEmpty Property

Test to see if the set is empty.

## Syntax (C#)
```csharp
public virtual bool IsEmpty { get; }
```

## Remarks
If the set is empty then True will be returned, otherwise False.